WCF/DiaView.WCF/demo/security/DiaView.WCF.Demo.Sercurity.Client/Req_Res.xml

POST /WCFService/GetIdentity HTTP/1.1
Content-Type: text/xml; charset=utf-8
SOAPAction: "http://chnking.com/IGetIdentity/Get"
Host: localhost:8055
Content-Length: 186
Expect: 100-continue
Connection: Keep-Alive

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body>
		<Get xmlns="http://chnking.com">
			<ClientIdentity>WIN2008\Administrator</ClientIdentity>
		</Get>
	</s:Body>
</s:Envelope>

HTTP/1.1 100 Continue

HTTP/1.1 200 OK
Content-Length: 245
Content-Type: text/xml; charset=utf-8
Server: Microsoft-HTTPAPI/2.0
Date: Thu, 02 Oct 2008 14:42:16 GMT

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
	<s:Body>
		<GetResponse xmlns="http://chnking.com">
			<GetResult>
				Identity of server is''
				&#xD;Identity of client is 'WIN2008\Administrator'
			</GetResult>
		</GetResponse>
	</s:Body>
</s:Envelope>